bit-finance/Reports/бит_ОтчетПоТипамПроводок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>бит_ОтчетПоТипамПроводок</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РегистрБухгалтерии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ОбъектыСистемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.бит_Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаПериода</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтображатьПустыеКолонки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

bit-finance/Reports/бит_ОтчетПоТипамПроводок/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ДополнительныеСписки

// Процедура заполняет дополнительные списки.
// 
// Параметры:
//  СписокПараметровНаФорме - СписокЗначений ИЛИ Неопределено
// 
Процедура ЗаполнитьДополнительныеСписки(СписокПараметровНаФорме) Экспорт
	
	// Список имен параметров СКД, заполняемых пользователем через элементы формы.
	СписокПараметровНаФорме.Добавить("Период"			 , "Период");
	СписокПараметровНаФорме.Добавить("РегистрБухгалтерии", "РегистрБухгалтерии");
	СписокПараметровНаФорме.Добавить("Организация", "Организация");
	СписокПараметровНаФорме.Добавить("ОтображатьПустыеКолонки", "ОтображатьПустыеКолонки");
	
	// Список дополнительных свойств
	// фСписокДополнительныхСвойств.Добавить("ДопСвойство");

КонецПроцедуры // ЗаполнитьДополнительныеСписки()

#КонецОбласти
 
#КонецЕсли
